_Rarzrabotki/Rarus/USO2/Documents/СМ_СводнаяСмета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>СМ_СводнаяСмета</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазисныеЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_СводнаяСмета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инвестор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодикаРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_МетодикиРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСметы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечатьПромежуточныхИтогов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подрядчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроводитьОкругление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоставленаВЦенахНа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_СтатусыСметныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стройка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСтроительства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ТипыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматОкругления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сметы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерПП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Смета</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СМ_ОбъектнаяСмета</v8:Type>
								<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГлаваССРС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СМ_ГлавыССРС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОбъектов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расчет</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЛимитированныеЗатраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛимитированнаяЗатрата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СМ_ЛимитированныеЗатраты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормулаЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазисноеЗначениеЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормулаБазисногоЗначениеЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентСметнойЗарплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентТрудоемкости</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расчет</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыводитьВШапку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РазбивкаПоГодам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Год</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_СтатусыСметныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_СтатусыСметныхДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Архив</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РедактированиеЦен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ТипыСтроительства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ТипыСтроительства</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НовоеСтроительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КапитальныйРемонт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДорожноеСтроительство</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/СМ_ШаблоныЛимитированныхЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>СМ_ШаблоныЛимитированныхЗатрат</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ЛимитированныеЗатраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛимЗатрата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СМ_ЛимитированныеЗатраты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/СМ_ИтогиПоГлавам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>СМ_ИтогиПоГлавам</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВыводитьНаПечать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлаваРемонт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ГлавыССРС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлаваССРС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ГлавыССРС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодикаРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_МетодикиРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеРемонт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Накопительный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/СМ_ИтогиСметыПоВидамРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>СМ_ИтогиСметыПоВидамРабот</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Накопительный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/СМ_СводнаяСмета/Forms/ФормаДокументаУпр/Ext/Form/Module.bsl
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПроверитьКорректностьДобавления(ТекЭлемент)
	
	Если ТипЗнч(ТекЭлемент) = Тип("СправочникСсылка.СМ_ГлавыССРС") Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;	
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьОС(Команда)
	
	ТекДанные = Элементы.ДеревоСС.ТекущиеДанные;
	Если НЕ ПроверитьКорректностьДобавления(ТекДанные.Элемент) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Сметы можно добавлять только в главу!'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;	
	
	ТекущаяГлаваССРС 	= ТекДанные.Глава;
	// Получаем массив смет из ТЧ
	МассивСмет = Новый Массив;
	Для Каждого ТекСтрока Из Объект.Сметы Цикл
		МассивСмет.Добавить(ТекСтрока.Смета);
	КонецЦикла;

	ОтборСмет = Новый Структура("МассивСмет",МассивСмет);
	ОткрытьФорму("Документ.СМ_ОбъектнаяСмета.Форма.ФормаВыбораУпр",ОтборСмет,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЛС(Команда)
	
	ТекДанные = Элементы.ДеревоСС.ТекущиеДанные;
	Если НЕ ПроверитьКорректностьДобавления(ТекДанные.Элемент) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Сметы можно добавлять только в главу!'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;		
	
	ТекущаяГлаваССРС 	= ТекДанные.Глава;
	// Получаем массив смет из ТЧ
	МассивСмет = Новый Массив;
	Для Каждого ТекСтрока Из Объект.Сметы Цикл
		МассивСмет.Добавить(ТекСтрока.Смета);
	КонецЦикла;
	ОтборСмет = Новый Структура("МассивОС",МассивСмет);
	ОткрытьФорму("Документ.СМ_ЛокальнаяСмета.Форма.ФормаВыбораУпр",ОтборСмет,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЛЗ(Команда)
	
	СтруктураПараметровЛЗ 	= ПолучитьСтруктуруПараметровЛЗ();
	ОткрытьФорму("Документ.СМ_СводнаяСмета.Форма.ФормаПодбораЛимитированныхЗатрат",СтруктураПараметровЛЗ,ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруПараметровЛЗ()
	
	ТекОбъект 				= РеквизитФормыВЗначение("Объект");
	СписокЛЗ 				= ТекОбъект.ЛимитированныеЗатраты.ВыгрузитьКолонку("ЛимитированнаяЗатрата");
	СтруктураПараметровЛЗ 	= Новый Структура("СписокЛЗ, МетодикаРасчета",СписокЛЗ, Объект.МетодикаРасчета);
	
	Возврат СтруктураПараметровЛЗ; 
	
КонецФункции

&НаКлиенте
Процедура ДобавитьЛЗпоШаблону(Команда)
	
	Если Объект.ЛимитированныеЗатраты.Количество()>0 Тогда
		
		ТекстВопроса = НСтр("ru='При вставке шаблона будут удалены уже введенные лимитированные затраты! 
		|Продолжать (Кнопка ""Да"") ? Кнопка ""Нет"" отказ.'");
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаШаблон", ЭтаФорма,);
		ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0);
	Иначе
		ОЗакрытииФормыВыбораШаблона = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбораШаблона",ЭтаФорма);
		ОткрытьФорму("Справочник.СМ_ШаблоныЛимитированныхЗатрат.ФормаВыбора",,ЭтаФорма,,,,ОЗакрытииФормыВыбораШаблона,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаШаблон(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;
	ОЗакрытииФормыВыбораШаблона = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбораШаблона",ЭтаФорма);
	ОткрытьФорму("Справочник.СМ_ШаблоныЛимитированныхЗатрат.ФормаВыбора",,ЭтаФорма,,,,ОЗакрытииФормыВыбораШаблона,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура СдвинутьВверх(Команда)
	
	ТекДанные = Элементы.ДеревоСС.ТекущиеДанные;
	Если ТипЗнч(ТекДанные.Элемент) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета")
		ИЛИ ТипЗнч(ТекДанные.Элемент) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") Тогда
		СдвинутьВверхНаСервере(ТекДанные.Элемент);
		ОбновитьДеревоСС();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СдвинутьВниз(Команда)
	
	ТекДанные = Элементы.ДеревоСС.ТекущиеДанные;
	Если ТипЗнч(ТекДанные.Элемент) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета")
		ИЛИ ТипЗнч(ТекДанные.Элемент) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") Тогда
		СдвинутьВнизНаСервере(ТекДанные.Элемент);
		ОбновитьДеревоСС();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокГлавДереваСС()
	
	ДеревоЗначений = РеквизитФормыВЗначение("ДеревоСС", Тип("ДеревоЗначений"));
	МассивГлав = Новый Массив;
	Для Каждого ТекСтрока Из ДеревоЗначений.Строки[0].Строки Цикл
		Если НЕ ЗначениеЗаполнено(ТекСтрока.Итог) Тогда
			МассивГлав.Добавить(ТекСтрока.Глава);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивГлав;
	
КонецФункции

&НаСервере
Процедура СдвинутьВверхНаСервере(ТекЛС)
	
	ТекОбъект 			= РеквизитФормыВЗначение("Объект");
	ТабСметы 			= ТекОбъект.Сметы;
	НайденнаяСтрока 	= ТабСметы.Найти(ТекЛС);
	
	// 1. Получение списка глав в дереве смет
	МассивГлав = ПолучитьСписокГлавДереваСС();
	
	// 2. Получение новой позиции и сдвиг строки
	Если НайденнаяСтрока <> Неопределено Тогда
		
		НовыйНомер 		= НайденнаяСтрока.НомерПП - 1;
		НомерПредСтроки = НайденнаяСтрока.НомерПП;
		
		// Необходимо передвинуть в новую главу.
		Если НовыйНомер = 0 Тогда
			
			ИндексГлавы 		= МассивГлав.Найти(НайденнаяСтрока.ГлаваССРС);
			ИндексНовойГлавы 	= ИндексГлавы - 1;
			
			Если ИндексГлавы = 0 Тогда
				НоваяГлава 	= МассивГлав.Получить(МассивГлав.Количество()-1);
			Иначе
				НоваяГлава 	= МассивГлав.Получить(ИндексНовойГлавы);
			КонецЕсли;	
			
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("ГлаваССРС",НоваяГлава);
			
			МассивСтрок 		= ТабСметы.НайтиСтроки(СтруктураОтбора);
			КоличествоСтрок4 	= МассивСтрок.Количество();
			
			НайденнаяСтрока.НомерПП 	= КоличествоСтрок4 + 1;
			НайденнаяСтрока.ГлаваССРС	= НоваяГлава;
			
			ТекНомПП = 1;
			Для Каждого ТекСтрока Из ТабСметы  Цикл
				Если ТекСтрока <> НайденнаяСтрока Тогда
					ТекСтрока.НомерПП = ТекНомПП;
					ТекНомПП = ТекНомПП + 1;
				КонецЕсли;
			КонецЦикла;
		// Передвигаем в пределах текущей главы	
		Иначе
			НайденнаяСтрока.НомерПП = НовыйНомер;
		    ИндексТекСтроки 		= ТабСметы.Индекс(НайденнаяСтрока);
			ПредСтрока 				= ТабСметы.Получить(ИндексТекСтроки-1);			
			ПредСтрока.НомерПП 		= НомерПредСтроки;
		КонецЕсли;
		
	КонецЕсли;
	
	ТабСметы.Сортировать("НомерПП Возр");
	
	ЗначениеВРеквизитФормы(ТабСметы,"Объект.Сметы");
	
КонецПроцедуры

&НаСервере
Процедура СдвинутьВнизНаСервере(ТекЛС)
	
	ТекОбъект 			= РеквизитФормыВЗначение("Объект");
	ТабСметы 			= ТекОбъект.Сметы;
	НайденнаяСтрока 	= ТабСметы.Найти(ТекЛС);
	
	// 1. Получение списка глав в дереве смет
	МассивГлав = ПолучитьСписокГлавДереваСС();

	Если НайденнаяСтрока <> Неопределено Тогда
		
		НовыйНомер 		= НайденнаяСтрока.НомерПП + 1;
		НомерПредСтроки = НайденнаяСтрока.НомерПП;
		КоличествоГлав 	= ПолучитьКоличествоЭлементовПоГлаве(НайденнаяСтрока.ГлаваССРС);
		Если НовыйНомер > КоличествоГлав Тогда
		
			ИндексГлавы 	 = МассивГлав.Найти(НайденнаяСтрока.ГлаваССРС);
			ИндексНовойГлавы = ИндексГлавы + 1;
			
			НайденнаяСтрока.НомерПП = 1;
			ТекНомПП = 2;
			Для Каждого ТекСтрока Из ТабСметы  Цикл
				Если ТекСтрока <> НайденнаяСтрока Тогда
					ТекСтрока.НомерПП = ТекНомПП;
					ТекНомПП = ТекНомПП + 1;
				КонецЕсли;
			КонецЦикла;
		Иначе
			НайденнаяСтрока.НомерПП = НовыйНомер;
		    ИндексТекСтроки 		= ТабСметы.Индекс(НайденнаяСтрока);
			ПредСтрока 				= ТабСметы.Получить(ИндексТекСтроки+1);			
			ПредСтрока.НомерПП 		= НомерПредСтроки;
		КонецЕсли;
		
	КонецЕсли;
	
	ТабСметы.Сортировать("НомерПП Возр");
	
	ЗначениеВРеквизитФормы(ТабСметы,"Объект.Сметы");
	
КонецПроцедуры

&НаСервере
Процедура УдалитьСтрокуНаСервере(ТекСсылка)
	
	СтруктураОтбора 		= Новый Структура;
	МассивУдаляемыхСтрок 	= Новый Массив;
	НазваниеТЧ				= "";
	Если ТипЗнч(ТекСсылка) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета")
		ИЛИ ТипЗнч(ТекСсылка) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") Тогда
		СтруктураОтбора.Вставить("Смета",ТекСсылка);		
		МассивУдаляемыхСтрок = Объект.Сметы.НайтиСтроки(СтруктураОтбора);
		НазваниеТЧ = "Сметы";
		ОчиститьИдРодителяЭлемента(ТекСсылка);
	ИначеЕсли ТипЗнч(ТекСсылка) = Тип("СправочникСсылка.СМ_ЛимитированныеЗатраты") Тогда
		СтруктураОтбора.Вставить("ЛимитированнаяЗатрата",ТекСсылка);	
		МассивУдаляемыхСтрок = Объект.ЛимитированныеЗатраты.НайтиСтроки(СтруктураОтбора);
		НазваниеТЧ = "ЛимитированныеЗатраты";
	КонецЕсли;
	
	Если МассивУдаляемыхСтрок.Количество() > 0 Тогда
		Для Каждого ТекСтрока Из МассивУдаляемыхСтрок Цикл
			Объект[НазваниеТЧ].Удалить(ТекСтрока);
		КонецЦикла;
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОчиститьИдРодителяЭлемента(ТекЭлемент = Неопределено)
	
	ПустаяСсылкаСС	= Документы.СМ_СводнаяСмета.ПустаяСсылка();
	
	Если ТипЗнч(ТекЭлемент) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета")
		ИЛИ ТипЗнч(ТекЭлемент) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") Тогда
		Если ЗначениеЗаполнено(ТекЭлемент.ИдРодителя) Тогда
			Попытка 
				ТекОбъект 				= ТекЭлемент.ПолучитьОбъект();
				ТекОбъект.ИдРодителя 	= ПустаяСсылкаСС;
				ТекОбъект.Записать();
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Ошибка изменения объекта'")+" ", ТекЭлемент));
			КонецПопытки;
		КонецЕсли;
	Иначе
		Для Каждого ТекСтрока Из Объект.Сметы Цикл
			Если ЗначениеЗаполнено(ТекСтрока.Смета.ИдРодителя) Тогда
				Попытка 
					ТекОбъект 				= ТекСтрока.Смета.ПолучитьОбъект();
					ТекОбъект.ИдРодителя 	= ПустаяСсылкаСС;
					ТекОбъект.Записать();
				Исключение
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Ошибка изменения объекта'")+" ", ТекСтрока.Смета));
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтроку(Команда)
	
	ТекДанные = Элементы.ДеревоСС.ТекущиеДанные;
	
	Если ТипЗнч(ТекДанные.Элемент) <> Тип("ДокументСсылка.СМ_ЛокальнаяСмета")
		И ТипЗнч(ТекДанные.Элемент) <> Тип("ДокументСсылка.СМ_ОбъектнаяСмета")
		И ТипЗнч(ТекДанные.Элемент) <> Тип("СправочникСсылка.СМ_ЛимитированныеЗатраты") Тогда
		Возврат;
	Иначе
		ТекСтрока = СМ_СметныйСоставКлиент.ТекущаяСтрокаПослеУдаленияВДереве(ДеревоСС, ТекДанные);
		СсылкаЛС = ТекДанные.Элемент;
		УдалитьСтрокуНаСервере(ТекДанные.Элемент);
		ЭтаФорма.Модифицированность = Истина;
		ОбновитьДеревоСС(ТекСтрока);
		Если ТипЗнч(СсылкаЛС) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") 
			И ЭтаСметаРассчитана(СсылкаЛС) Тогда
			Записать();
			СМ_СметаВызовСервера.УдалитьДвижения(СсылкаЛС);
			СМ_СметаВызовСервера.УдалитьЛС(СсылкаЛС);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЭтаСметаРассчитана(СсылкаЛС)
   Возврат СсылкаЛС.СметаРассчитана;	
КонецФункции

&НаСервере
Процедура ОчиститьСтрокиНаСервере()
	
	Попытка
		ОчиститьИдРодителяЭлемента();
		Объект.Сметы.Очистить();
		Объект.ЛимитированныеЗатраты.Очистить();
		ТекОбъект = РеквизитФормыВЗначение("Объект");
		ТекОбъект.Записать(РежимЗаписиДокумента.Запись);
		ЗначениеВРеквизитФормы(ТекОбъект,"Объект");
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Произошла ошибка при очистке табличных частей объекта'"));
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСтроки(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОчистка", ЭтаФорма);
	ПоказатьВопрос(Оповещение, НСтр("ru='Будут очищены табличные части ""Сметы"" и ""Лимитированные затраты"", продолжить?'"), Режим, 0);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОчистка(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
	
	ОчиститьСтрокиНаСервере();
	ОбновитьДеревоСС();

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	Если Объект.БазисныеЦены Тогда
		ЭтаФорма.ТипЦен	= 1;
	Иначе
		ЭтаФорма.ТипЦен	= 2;
	КонецЕсли;
	
	ТолькоПросмотрФормы = СМ_СметаВызовСервера.РольТолькоПросмотр();
	Архив = (Объект.Статус = Перечисления.СМ_СтатусыСметныхДокументов.Архив);
	Админ = Пользователи.РолиДоступны("СМ_АдминистраторСмета, ПолныеПрава",,Ложь);
	ТолькоПросмотрФормы = ?(Архив,Архив,ТолькоПросмотрФормы);

	Если Объект.Ссылка.Пустая() Тогда
		Элементы.ГруппаСоставСметы.Доступность = Ложь;
		// Заполнить настройки пользователя по умолчанию
		СМ_СметаВызовСервера.ЗаполнитьНастройкиПользователяПоУмолчанию(Объект);
		Объект.ПроводитьОкругление 	= Истина;
		Объект.ФорматОкругления 	= 3;
	Иначе	
		ОбновитьДеревоССНаСервере(); 
	КонецЕсли;
	
	
	Если Параметры.Свойство("Стройка") Тогда
		Объект.Стройка = Параметры.Стройка;
		СМ_СметаВызовСервера.ЗаполнитьНаименованиеНомерИзШаблона(Объект, Элементы.Наименование, "НумераторСводныхСмет");
	КонецЕсли;
	Если Параметры.Свойство("ЛимЗатрата") Тогда
		Стр = Объект.ЛимитированныеЗатраты.Выгрузить().Найти(Параметры.ЛимЗатрата,"ЛимитированнаяЗатрата");
		Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаЛимитированныеЗатраты;
		Элементы.ЛимитированныеЗатраты.ТекущаяСтрока = Стр.НомерСтроки-1;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("СМ_КЗ_МетодикаРСНБКазахстан") Тогда
		Элементы.ГруппаГода.Видимость = Ложь;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаСервере
Процедура ОбновитьДеревоССНаСервере() 
	
	ДеревоЗначений = РеквизитФормыВЗначение("ДеревоСС", Тип("ДеревоЗначений"));
	ДеревоЗначений.Строки.Очистить();
	СМ_СметныйСоставВызовСервера.ВывестиДеревоСС(ДеревоЗначений,Объект,ЭтаФорма.ТипЦен);
	ЗначениеВРеквизитФормы(ДеревоЗначений,"ДеревоСС");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоЭлементовПоГлаве(ТекГлава) 
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ГлаваССРС",ТекГлава);
	
	МассивСтрок = Объект.Сметы.НайтиСтроки(СтруктураОтбора);
	Возврат МассивСтрок.Количество();
	
КонецФункции

&НаСервере
Процедура ОбработатьЛимЗатратыСметы(Смета) 
	ИспользоватьЛимЗатратыВсегда = СМ_СметаВызовСервера.ЗначениеОпции("СМ_ИспользоватьЛимитированныеЗатратыПодчиненныхСмет");
	Если Не ИспользоватьЛимЗатратыВсегда Тогда
		Если Смета.ЛимитированныеЗатраты.Количество()>0 Тогда
			ОбСмета = Смета.ПолучитьОбъект();
			ТЗ = ОбСмета.ЛимитированныеЗатраты.Выгрузить();
			ТЗ.ЗаполнитьЗначения(Ложь,"Расчет");
			ОбСмета.ЛимитированныеЗатраты.Загрузить(ТЗ);
			ОбСмета.Записать();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Лимитированные затраты локальной сметы при включении ее в состав объектной сметы при расчете не учитываются.'"));
			// Очищаем движения по локальной смете.
			Отбор = Новый Структура("Смета",Смета);
			СМ_СметаВызовСервера.ЗаписатьРеквизитыРегистраСведенийНабор("СМ_ИтогиПоГлавам", Отбор, Новый ТаблицаЗначений);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ИсточникВыбора) = Тип("УправляемаяФорма") Тогда
		
		ТекДанные = Элементы.ДеревоСС.ТекущиеДанные;
		СтрокаДерева = Неопределено;
		СМ_СметныйСоставКлиент.СохранитьТекущийЭлемент(СтрокаДерева, ТекДанные, Элементы.ДеревоСС, ДеревоСС.ПолучитьЭлементы());
 			
		Если ИсточникВыбора.ИмяФормы = "Документ.СМ_ЛокальнаяСмета.Форма.ФормаВыбораУпр"
			ИЛИ ИсточникВыбора.ИмяФормы = "Документ.СМ_ОбъектнаяСмета.Форма.ФормаВыбораУпр" Тогда
			 
			// Получаем количество элементов по данной главе ССРС
			ТекКоличество = ПолучитьКоличествоЭлементовПоГлаве(ЭтаФорма.ТекущаяГлаваССРС); 
			 
			Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
				Если ВыбранноеЗначение.Количество() > 0 Тогда   
					Для Каждого ТекЭлемент Из ВыбранноеЗначение Цикл
						ТекКоличество 					= ТекКоличество + 1;
						НоваяСтрока 					= Объект.Сметы.Добавить();
						НоваяСтрока.Смета 				= ТекЭлемент;
						НоваяСтрока.ГлаваССРС			= ЭтаФорма.ТекущаяГлаваССРС;
						НоваяСтрока.КоличествоОбъектов 	= 1;
						НоваяСтрока.НомерПП				= ТекКоличество;
						НоваяСтрока.Расчет				= Истина;
						Если ИсточникВыбора.ИмяФормы = "Документ.СМ_ЛокальнаяСмета.Форма.ФормаВыбораУпр" Тогда
							ОбработатьЛимЗатратыСметы(ТекЭлемент);	
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			Иначе
				ТекКоличество 					= ТекКоличество + 1;
				НоваяСтрока 					= Объект.Сметы.Добавить();
				НоваяСтрока.Смета 				= ВыбранноеЗначение;
				НоваяСтрока.ГлаваССРС			= ЭтаФорма.ТекущаяГлаваССРС;
				НоваяСтрока.КоличествоОбъектов 	= 1;
				НоваяСтрока.НомерПП				= ТекКоличество;
				НоваяСтрока.Расчет 				= Истина;
				Если ИсточникВыбора.ИмяФормы = "Документ.СМ_ЛокальнаяСмета.Форма.ФормаВыбораУпр" Тогда
					ОбработатьЛимЗатратыСметы(ВыбранноеЗначение);	
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИсточникВыбора.ИмяФормы = "Документ.СМ_СводнаяСмета.Форма.ФормаПодбораЛимитированныхЗатрат" Тогда
			Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
				Если ВыбранноеЗначение.Количество() > 0 Тогда   
					Для Каждого ТекЭлемент Из ВыбранноеЗначение Цикл
						НоваяСтрока = Объект.ЛимитированныеЗатраты.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекЭлемент);
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.СМ_ШаблоныЛимитированныхЗатрат.Форма.ФормаВыбора" Тогда
			Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.СМ_ШаблоныЛимитированныхЗатрат") Тогда
				ЗаполнитьТЧСтрокамиШаблонаЛЗ(ВыбранноеЗначение);
			КонецЕсли;
			
		КонецЕсли;  
		
		// Перенумерация таблицы "Сметы" после вставки нового документа
		ТекНомер = 1;
		Объект.Сметы.Сортировать("ГлаваССРС,Смета");
		Для Каждого ТекСтрока Из Объект.Сметы Цикл
			ТекСтрока.НомерПП	= ТекСтрока.НомерСтроки;
			ТекНомер = ТекНомер + 1;
		КонецЦикла;
		
		ЭтаФорма.Модифицированность = Истина;
		ОбновитьДеревоСС(); 
		
		СМ_СметныйСоставКлиент.ВосстановитьТекущийЭлемент(Элементы.ДеревоСС, ДеревоСС.ПолучитьЭлементы(), ДеревоСС, СтрокаДерева);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧСтрокамиШаблонаЛЗ(ВыбранноеЗначение)
	
	ТекОбъект 	= ВыбранноеЗначение.ПолучитьОбъект();
	ТекОбъектОС = РеквизитФормыВЗначение("Объект");
	
	Для Каждого СтрокаЛЗ Из ТекОбъект.ЛимитированныеЗатраты Цикл
		ТекСтрока = ТекОбъектОС.ЛимитированныеЗатраты.Найти(СтрокаЛЗ.ЛимЗатрата); 
		Если ТекСтрока <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока 						= Объект.ЛимитированныеЗатраты.Добавить();
		НоваяСтрока.ЛимитированнаяЗатрата 	= СтрокаЛЗ.ЛимЗатрата;
		НоваяСтрока.Расчет 					= Истина;
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДеревоСС(СохраненнаяСтрока = Неопределено) 

	ТекДанные = Элементы.ДеревоСС.ТекущиеДанные;
	СтрокаДерева = Неопределено;
	СМ_СметныйСоставКлиент.СохранитьТекущийЭлемент(СтрокаДерева, ТекДанные, Элементы.ДеревоСС, ДеревоСС.ПолучитьЭлементы());
	Если СохраненнаяСтрока <> Неопределено Тогда
		СтрокаДерева.ТекущийЭлемент = СохраненнаяСтрока;
	КонецЕсли;
 	ОбновитьДеревоССНаСервере();
	СМ_СметныйСоставКлиент.ВосстановитьТекущийЭлемент(Элементы.ДеревоСС, ДеревоСС.ПолучитьЭлементы(), ДеревоСС, СтрокаДерева);
			
КонецПроцедуры

&НаКлиенте
Процедура ТипЦенПриИзменении(Элемент)
	
	Если ЭтаФорма.ТипЦен = 2 Тогда
		Объект.БазисныеЦены = Ложь;
	Иначе
		Объект.БазисныеЦены = Истина;
	КонецЕсли;
	

	ОбновитьДеревоСС();

КонецПроцедуры

&НаКлиенте
Процедура ДеревоССВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекЭлемент = Элементы.ДеревоСС.ТекущиеДанные.Элемент;
	Если ТипЗнч(ТекЭлемент) = Тип("СправочникСсылка.СМ_ЛимитированныеЗатраты") Тогда
		СтандартнаяОбработка = Ложь;
	    Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаЛимитированныеЗатраты;
		ТекИндекс = ПолучитьИндексТекСтроки(ТекЭлемент);
		Если ТекИндекс <> Неопределено Тогда
			Элементы.ЛимитированныеЗатраты.ТекущаяСтрока = ТекИндекс;
		КонецЕсли;
	КонецЕсли;		
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИндексТекСтроки(ТекСсылка)
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	НайденнаяСтрока = ТекОбъект.ЛимитированныеЗатраты.Найти(ТекСсылка,"ЛимитированнаяЗатрата");
	Если НайденнаяСтрока = Неопределено Тогда
		ТекИндекс = Неопределено;		
	Иначе
		ТекИндекс = ТекОбъект.ЛимитированныеЗатраты.Индекс(НайденнаяСтрока);
	КонецЕсли;
	
	Возврат ТекИндекс;
	
КонецФункции

&НаСервере
Функция ИзменитьСоответствиеГлавССРС()
	
	ТабИтоговПоГлавам = ПолучитьИтогиПоГлавам();

	// Смена с дорожного или нового типа строительства на кап.ремонт
	Если ЭтаФорма.ТекТипСтроительства = Перечисления.СМ_ТипыСтроительства.ДорожноеСтроительство
		ИЛИ ЭтаФорма.ТекТипСтроительства = Перечисления.СМ_ТипыСтроительства.НовоеСтроительство Тогда
		Если Объект.ТипСтроительства = Перечисления.СМ_ТипыСтроительства.КапитальныйРемонт Тогда
			Для Каждого ТекСтрока Из Объект.Сметы Цикл
				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("ГлаваССРС",ТекСтрока.ГлаваССРС);
				МассивСтрок = ТабИтоговПоГлавам.НайтиСтроки(СтруктураОтбора);
				Если МассивСтрок.Количество() > 0 Тогда
					ТекСтрока.ГлаваССРС = МассивСтрок[0].ГлаваРемонт;			
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	// Смена с кап.ремонта на новое или дорожное строительство
	ИначеЕсли ЭтаФорма.ТекТипСтроительства = Перечисления.СМ_ТипыСтроительства.КапитальныйРемонт Тогда
		Если Объект.ТипСтроительства = Перечисления.СМ_ТипыСтроительства.ДорожноеСтроительство
			ИЛИ Объект.ТипСтроительства = Перечисления.СМ_ТипыСтроительства.НовоеСтроительство Тогда
			Для Каждого ТекСтрока Из Объект.Сметы Цикл
				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("ГлаваРемонт",ТекСтрока.ГлаваССРС);
				МассивСтрок = ТабИтоговПоГлавам.НайтиСтроки(СтруктураОтбора);
				Если МассивСтрок.Количество() > 0 Тогда
					ТекСтрока.ГлаваССРС = МассивСтрок[0].ГлаваССРС;			
				КонецЕсли;
			КонецЦикла;
		КонецЕсли; 
	КонецЕсли;
	
 КонецФункции

&НаСервере
Функция ПолучитьИтогиПоГлавам()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СМ_ИтогиПоГлавам.Ссылка,
	|	СМ_ИтогиПоГлавам.ВерсияДанных,
	|	СМ_ИтогиПоГлавам.ПометкаУдаления,
	|	СМ_ИтогиПоГлавам.Код,
	|	СМ_ИтогиПоГлавам.Наименование,
	|	СМ_ИтогиПоГлавам.Идентификатор,
	|	СМ_ИтогиПоГлавам.ГлаваССРС,
	|	СМ_ИтогиПоГлавам.ГлаваРемонт,
	|	СМ_ИтогиПоГлавам.НаименованиеРемонт,
	|	СМ_ИтогиПоГлавам.Накопительный,
	|	СМ_ИтогиПоГлавам.ПорядковыйНомер,
	|	СМ_ИтогиПоГлавам.Предопределенный,
	|	СМ_ИтогиПоГлавам.ИмяПредопределенныхДанных,
	|	СМ_ИтогиПоГлавам.Представление
	|ИЗ
	|	Справочник.СМ_ИтогиПоГлавам КАК СМ_ИтогиПоГлавам";
	
	ТабИтогов = Запрос.Выполнить().Выгрузить();
	Возврат ТабИтогов;
	
КонецФункции

// ДокторСофт

&НаКлиенте
&НаКлиенте
Процедура Мобильное(Команда)
	Если Объект.Ссылка.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Документ не записан в базе!'"),СтатусСообщения.ОченьВажное);
		Возврат;
	КонецЕсли;
	СписокУзлов = ПолучитьУзлыПоУмолчанию();
	Если СписокУзлов = Неопределено Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораУзлов", ЭтаФорма);
		ОткрытьФорму("Обработка.СМ_ВыборУзловМП.Форма.Форма",,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ИначеЕсли СписокУзлов.Количество() = 0 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораУзлов", ЭтаФорма);
		ОткрытьФорму("Обработка.СМ_ВыборУзловМП.Форма.Форма",,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		МобильноеНаСервере(СписокУзлов);
		ВидимостьМобильнойКнопки();
	КонецЕсли;		

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораУзлов(Результат, СтруктураПараметров) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	МассивСтруктур = Новый Массив;
	МассивСтруктур.Добавить(ОписаниеНастройки(
	"НастройкиПользователяСмета",
	"ОсновнойУзелМП",
	Результат));
	ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранитьМассивИОбновитьПовторноИспользуемыеЗначения(МассивСтруктур);
	
	МобильноеНаСервере(Результат);
	ВидимостьМобильнойКнопки();

КонецПроцедуры

Функция ОписаниеНастройки(Объект, Настойка, Значение)
	
	Элемент = Новый Структура;
	Элемент.Вставить("Объект", Объект);
	Элемент.Вставить("Настройка", Настойка);
	Элемент.Вставить("Значение", Значение);
	
	Возврат Элемент;
	
КонецФункции


&НаСервере
Функция ПолучитьУзлыПоУмолчанию()
    СписокУзлов = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета","ОсновнойУзелМП");
	Возврат СписокУзлов;
КонецФункции

&НаСервере
Процедура МобильноеНаСервере(СписокУзлов)
	Для каждого ВыбУзел Из СписокУзлов Цикл
		Если ВыбУзел.Значение.Ссылка =  ПланыОбмена.СМ_ОбменСметаМобильное.ЭтотУзел() ИЛИ ВыбУзел.Значение.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		НайденаЛС = ВыбУзел.Значение.ДокументыДляОбмена.Найти(Объект.Ссылка,"ДокументОтбор");
		Если НайденаЛС = Неопределено Тогда
			Узел = ВыбУзел.Значение.ПолучитьОбъект();
			Стр = Узел.ДокументыДляОбмена.Добавить();
			Стр.ДокументОтбор = Объект.Ссылка;
			Для каждого СметаСтр Из Объект.Сметы Цикл
				Стр = Узел.ДокументыДляОбмена.Добавить();
				Стр.ДокументОтбор = СметаСтр.Смета;
				Если ТипЗнч(СметаСтр.Смета) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") Тогда
					Для каждого СметаОС Из СметаСтр.Смета.ЛокальныеСметы Цикл
						Стр = Узел.ДокументыДляОбмена.Добавить();
						Стр.ДокументОтбор = СметаОС.ЛокальнаяСмета;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
			Узел.Записать();
		КонецЕсли;
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СМ_ОбменСметаМобильноеДокументыДляОбмена.Ссылка
	|ИЗ
	|	ПланОбмена.СМ_ОбменСметаМобильное.ДокументыДляОбмена КАК СМ_ОбменСметаМобильноеДокументыДляОбмена
	|ГДЕ
	|	СМ_ОбменСметаМобильноеДокументыДляОбмена.ДокументОтбор = &Док";
	Запрос.УстановитьПараметр("Док",Объект.Ссылка);
	МассивУзлов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов,Объект.Ссылка);
	
	Для каждого СметаСтр Из Объект.Сметы Цикл
		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов,СметаСтр.Смета);
		Если ТипЗнч(СметаСтр.Смета) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") Тогда 
			СМ_ОбменСМобильнымСервер.РегистрацияПозицийРазделов(МассивУзлов,СметаСтр.Смета);
		Иначе
			СМ_ОбменСМобильнымСервер.РегистрацияОС_ЛС(МассивУзлов,СметаСтр.Смета)
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЕстьУзлы()
	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	СМ_ОбменСметаМобильноеДокументыДляОбмена.Ссылка
		|ИЗ
		|	ПланОбмена.СМ_ОбменСметаМобильное.ДокументыДляОбмена КАК СМ_ОбменСметаМобильноеДокументыДляОбмена
		|ГДЕ
		|	СМ_ОбменСметаМобильноеДокументыДляОбмена.ДокументОтбор = &Док";
		Запрос.УстановитьПараметр("Док",Объект.Ссылка);
		Результат = Запрос.Выполнить();
		Возврат Результат.Пустой();
	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

&НаКлиенте
Процедура ВидимостьМобильнойКнопки() 
	ЕстьУзлы = ЕстьУзлы();
    Элементы.Мобильное.Видимость =  ?(ЕстьУзлы = Неопределено,Ложь,ЕстьУзлы);
	Элементы.УбратьМобильное.Видимость = ?(ЕстьУзлы = Неопределено,Ложь,Не ЕстьУзлы);
КонецПроцедуры

&НаКлиенте
Процедура УбратьМобильное(Команда)
	УбратьМобильноеНаСервере();
	ВидимостьМобильнойКнопки();
КонецПроцедуры

&НаСервере
Процедура УбратьМобильноеНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СМ_ОбменСметаМобильноеДокументыДляОбмена.Ссылка
	|ИЗ
	|	ПланОбмена.СМ_ОбменСметаМобильное.ДокументыДляОбмена КАК СМ_ОбменСметаМобильноеДокументыДляОбмена
	|ГДЕ
	|	СМ_ОбменСметаМобильноеДокументыДляОбмена.ДокументОтбор = &Док";
	Запрос.УстановитьПараметр("Док",Объект.Ссылка);
	МассивУзлов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	ПланыОбмена.УдалитьРегистрациюИзменений(МассивУзлов,Объект.Ссылка);
	Для каждого эл Из МассивУзлов Цикл
		Узел = эл.ПолучитьОбъект();
		НайденаЛС = Узел.ДокументыДляОбмена.Найти(Объект.Ссылка,"ДокументОтбор");
		Если Не НайденаЛС = Неопределено Тогда
			Узел.ДокументыДляОбмена.Удалить(НайденаЛС);
			Узел.Записать();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекГлаваССРС = СМ_СметныйСоставВызовСервера.ПолучитьГлавуПоУмолчанию(ТекущийОбъект.ТипСтроительства);
	
	// Заполнение реквизита "ИдРодителя" для локальных и объектных смет из табличной части "Сметы".
	Для Каждого ТекСтрока Из Объект.Сметы Цикл
		Если НЕ ЗначениеЗаполнено(ТекСтрока.Смета.ИДРодителя) Тогда
			Попытка 
				ТекОбъект 				= ТекСтрока.Смета.ПолучитьОбъект();
				ТекОбъект.ИдРодителя 	= ТекущийОбъект.Ссылка;
				Если Не ЗначениеЗаполнено(ТекОбъект.ГлаваССРС) Тогда
					ТекОбъект.ГлаваССРС = ТекГлаваССРС;	
				КонецЕсли;	
				ТекОбъект.Записать();
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Ошибка изменения объекта'")+" ", ТекСтрока.Смета));
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	Документы.СМ_СводнаяСмета.Перерасчет(Объект.Ссылка);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Отказ = СМ_ЗащитаКлиент.ЗапускОбъекта();
	Если Не Отказ Тогда
		ВидимостьМобильнойКнопки();
		ВидимостьДоступностьЭлементовНаФорме();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
    ЭтотОбъект.ПроверитьЗаполнение();
	Если НЕ ЗначениеЗаполнено(Объект.ТипСтроительства) Тогда
	   	Сообщение = Новый СообщениеПользователю();
	    Сообщение.Текст = НСтр("ru='Не заполнен реквизи ""Тип строительства"", запись отменена.'");
	    Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоССРасчетПриИзменении(Элемент)
	
	ТекДанные 	= Элементы.ДеревоСС.ТекущиеДанные;

	ДеревоССРасчетПриИзмененииНаСервере(ТекДанные.Элемент,ТекДанные.Расчет);
	
КонецПроцедуры

&НаСервере
Процедура ДеревоССРасчетПриИзмененииНаСервере(ТекЭлемент,ТекРасчет)
	
	СтруктураОтбора = Новый Структура;
	
	Если ТипЗнч(ТекЭлемент) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") ИЛИ ТипЗнч(ТекЭлемент) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") Тогда
		СтруктураОтбора.Вставить("Смета",ТекЭлемент);	
		МассивСтрок = Объект.Сметы.НайтиСтроки(СтруктураОтбора);
	ИначеЕсли ТипЗнч(ТекЭлемент) = Тип("СправочникСсылка.СМ_ЛимитированныеЗатраты") Тогда	
		СтруктураОтбора.Вставить("ЛимитированнаяЗатрата",ТекЭлемент);	
		МассивСтрок = Объект.ЛимитированныеЗатраты.НайтиСтроки(СтруктураОтбора);
	Иначе
		Возврат;
	КонецЕсли;	
	
	Если МассивСтрок.Количество() > 0 Тогда
		ТекСтрока 			= МассивСтрок[0];	
		ТекСтрока.Расчет 	= ТекРасчет;
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ДеревоССПередНачаломИзменения(Элемент, Отказ)
	
	ТекДанные = Элементы.ДеревоСС.ТекущиеДанные;
	ТекЭлемент = ТекДанные.Элемент; 
	Если ТипЗнч(ТекЭлемент) = Тип("СправочникСсылка.СМ_ГлавыССРС")
		ИЛИ ТипЗнч(ТекЭлемент) = Тип("СправочникСсылка.СМ_ИтогиПоГлавам")
		ИЛИ ТипЗнч(ТекЭлемент) = Тип("ДокументСсылка.СМ_СводнаяСмета")Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Элементы.ГруппаСоставСметы.Доступность = Истина;
	ОбновитьДеревоСС();

	// Оповещение открытых форм об изменении.
	// Например, обработки "Дерево смет".
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Стройка",Объект.Стройка);
	СтруктураПараметров.Вставить("Смета",Объект.Ссылка);
	Оповестить("ОбновитьДеревоСмет",СтруктураПараметров);
		
КонецПроцедуры

&НаКлиенте
Процедура СметыПриИзменении(Элемент)
	
	ОбновитьДеревоСС();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛимитированныеЗатратыПриИзменении(Элемент)
	
	ОбновитьДеревоСС();

КонецПроцедуры

&НаКлиенте
Процедура ТипСтроительстваПриИзменении(Элемент)
	
	ИзменитьСоответствиеГлавССРС();
	ОбновитьДеревоСС();

КонецПроцедуры

&НаКлиенте
Процедура ТипСтроительстваНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЭтаФорма.ТекТипСтроительства = Объект.ТипСтроительства;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛимитированныеЗатратыЛимитированнаяЗатратаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения("ПолучитьЛимитированныеЗатраты", ЭтотОбъект);
	ОткрытьФорму("Справочник.СМ_ЛимитированныеЗатраты.Форма.ФормаВыбораБезПомеченныхНаУдаление",,,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьЛимитированныеЗатраты(Результат, Структура) Экспорт
	Элементы.ЛимитированныеЗатраты.ТекущиеДанные.ЛимитированнаяЗатрата = Результат;
КонецПроцедуры

&НаКлиенте
Процедура ЛимитированныеЗатратыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Не Копирование Тогда
		Элемент.ТекущиеДанные.Расчет = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыборИзШаблонаНаСервере(Ссылка)
	
	Смета = РеквизитФормыВЗначение("Объект");
	Смета.ЛимитированныеЗатраты.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Шаблоны.ЛимЗатрата,
	               |	Шаблоны.Значение КАК ЗначениеПоУмолчанию
	               |ИЗ
	               |	Справочник.СМ_ШаблоныЛимитированныхЗатрат.ЛимитированныеЗатраты КАК Шаблоны
	               |ГДЕ
	               |	Шаблоны.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрЗапроса Из РезультатЗапроса Цикл
		НоваяСтрока = Смета.ЛимитированныеЗатраты.Добавить();
		НоваяСтрока.ЛимитированнаяЗатрата = СтрЗапроса.ЛимЗатрата;
		НоваяСтрока.ЗначениеЛимЗатраты = СтрЗапроса.ЗначениеПоУмолчанию;
		НоваяСтрока.БазисноеЗначениеЛимЗатраты = СтрЗапроса.ЗначениеПоУмолчанию;
		НоваяСтрока.Расчет = Истина;	
	КонецЦикла;
	ЗначениеВДанныеФормы(Смета, Объект);
	Модифицированность = Истина;
	
КонецПроцедуры

// Процедура осуществляет действия после закрытия формы выбора шаблона лим затрат для сметы.
// ПАРАМЕТРЫ:
//// Результат - ссылка на выбранный элемент.
//// Параметры - дополнительные параметры переданные при формировании вопроса пользователю.
&НаКлиенте
Процедура ПриЗакрытииФормыВыбораШаблона(Результат, Параметры) Экспорт
	Если Не Результат = Неопределено Тогда
		ВыборИзШаблонаНаСервере(Результат);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЛимитированныеЗатратыФормулаЛимЗатратыПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ЛимитированныеЗатраты.ТекущиеДанные;
	ТекЗначение = ТекущиеДанные.ЗначениеЛимЗатраты;
	ТекФормула = СокрЛП(ТекущиеДанные.ФормулаЛимЗатраты);
	Если ТекФормула <> "" Тогда
		ТекФормула = СтрЗаменить(ТекФормула,",",".");
		ТекущиеДанные.ФормулаЛимЗатраты = ТекФормула;
		Попытка
			Формула = "ТекЗначение = " + ТекущиеДанные.ФормулаЛимЗатраты + "; ТекущиеДанные.ЗначениеЛимЗатраты = ТекЗначение;";
			Выполнить(Формула);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Ошибка в формуле, значение затраты не изменено'"));
		КонецПопытки;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЛимитированныеЗатратыФормулаБазисногоЗначениеЛимЗатратыПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЛимитированныеЗатраты.ТекущиеДанные;
	ТекЗначение = ТекущиеДанные.БазисноеЗначениеЛимЗатраты;
	ТекФормула = СокрЛП(ТекущиеДанные.ФормулаБазисногоЗначениеЛимЗатраты);
	Если ТекФормула <> "" Тогда
		ТекФормула = СтрЗаменить(ТекФормула,",",".");
		ТекущиеДанные.ФормулаБазисногоЗначениеЛимЗатраты = ТекФормула;
		Попытка
			Формула = "ТекЗначение = " + ТекущиеДанные.ФормулаБазисногоЗначениеЛимЗатраты + "; ТекущиеДанные.БазисноеЗначениеЛимЗатраты = ТекЗначение;";
			Выполнить(Формула);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Ошибка в формуле, значение затраты не изменено'"));
		КонецПопытки;
	КонецЕсли;		

КонецПроцедуры

&НаКлиенте
Процедура ЛимитированныеЗатратыЗначениеЛимЗатратыПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ЛимитированныеЗатраты.ТекущиеДанные;
	ТекЗначение = ТекущиеДанные.ЗначениеЛимЗатраты;
	ТекФормула = СокрЛП(ТекущиеДанные.ФормулаЛимЗатраты);
	Если ТекФормула <> "" Тогда
		ТекФормула = СтрЗаменить(ТекФормула,",",".");
		ТекущиеДанные.ФормулаЛимЗатраты = ТекФормула;
		РассчитанноеЗначение = 0;
		Попытка
			Формула = "РассчитанноеЗначение = " + ТекущиеДанные.ФормулаЛимЗатраты;
			Выполнить(Формула);
			Если ТекЗначение <>  РассчитанноеЗначение Тогда
				ПоказатьПредупреждение(,НСтр("ru= 'Значение затраты отличается от рассчитанного по формуле!'"));
			КонецЕсли;	
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Ошибка в формуле, проверьте формулу'"));
		КонецПопытки;
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ЛимитированныеЗатратыБазисноеЗначениеЛимЗатратыПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ЛимитированныеЗатраты.ТекущиеДанные;
	ТекЗначение = ТекущиеДанные.БазисноеЗначениеЛимЗатраты;
	ТекФормула = СокрЛП(ТекущиеДанные.ФормулаБазисногоЗначениеЛимЗатраты);
	Если ТекФормула <> "" Тогда
		ТекФормула = СтрЗаменить(ТекФормула,",",".");
		ТекущиеДанные.ФормулаБазисногоЗначениеЛимЗатраты = ТекФормула;
		РассчитанноеЗначение = 0;
		Попытка
			Формула = "РассчитанноеЗначение = " + ТекущиеДанные.ФормулаБазисногоЗначениеЛимЗатраты;
			Выполнить(Формула);
			Если ТекЗначение <>  РассчитанноеЗначение Тогда
				ПоказатьПредупреждение(,НСтр("ru= 'Значение затраты отличается от рассчитанного по формуле!'"));
			КонецЕсли;	
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Ошибка в формуле, проверьте формулу'"));
		КонецПопытки;
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтроку(Команда)
	ТекДанные = Элементы.ДеревоСС.ТекущиеДанные;
	Если НЕ ПроверитьКорректностьДобавления(ТекДанные.Элемент) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Сметы можно добавлять только в главу!'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;		

	ТекущаяГлаваССРС 	= ТекДанные.Глава;
	Элементы.ДеревоСС.ДобавитьСтроку();
	НовСтрока = Элементы.ДеревоСС.ТекущиеДанные;
	НовСтрока.Расчет = Истина;
	
	ТекСч = ПолучитьКоличествоЭлементовПоГлаве(ТекущаяГлаваССРС)+1;
	НовСтрока.НомерПП				= ТекСч;
	НовСтрока.Глава			= ТекущаяГлаваССРС;
	НовСтрока.НоваяЛС               = Истина;
	НовСтрока.СметаРассчитана = Истина;
	НовСтрока.КоличествоОбъектов = 1;
	Элементы.ДеревоСС.ТекущийЭлемент = Элементы.ДеревоССГруппаСметы.ПодчиненныеЭлементы.ДеревоССНаименование;

КонецПроцедуры

&НаКлиенте
Процедура ДеревоССПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ТекДанные = Элементы.ДеревоСС.ТекущиеДанные;
	Если ТекДанные.НоваяЛС Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, Новый Структура("ТекДанные",ТекДанные));
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Сохранить локальную смету?';"+ " en = 'Do you want to continue?'"), Режим, 0);
	Иначе
		Рассчитана = СметаРассчитана(ТекДанные.Элемент);
		Если Рассчитана Тогда
			
			Если Объект.БазисныеЦены Тогда
				ИмяРесурса = "ПрямЗатраты,ОснЗарплата,Смета,Итог";
			Иначе
				ИмяРесурса = "ТекПрямЗатраты,ТекОснЗарплата,Смета,Итог";
			КонецЕсли;
			
			ДанныеДляЗаписи = Новый Структура(ИмяРесурса,ТекДанные.СтроительныеРаботы,ТекДанные.ОплатаТруда,ТекДанные.Элемент,ПредопределенноеЗначение("Справочник.СМ_ИтогиСметыПоВидамРабот.СтроитРаб"));
			Отбор = Новый Структура("Смета,Итог",ТекДанные.Элемент,ПредопределенноеЗначение("Справочник.СМ_ИтогиСметыПоВидамРабот.СтроитРаб"));
			СМ_СметаВызовСервера.ДополнитьРеквизитыРегистраСведенийНабор("СМ_ИтогиПоВидамРабот", Отбор, ДанныеДляЗаписи);
			
			Если Объект.БазисныеЦены Тогда
				ИмяРесурса = "ПрямЗатраты,Смета,Итог";
			Иначе
				ИмяРесурса = "ТекПрямЗатраты,Смета,Итог";
			КонецЕсли;

			ДанныеДляЗаписи = Новый Структура(ИмяРесурса,ТекДанные.МонтажныеРаботы,ТекДанные.Элемент,ПредопределенноеЗначение("Справочник.СМ_ИтогиСметыПоВидамРабот.МонтажнРаб"));
			Отбор = Новый Структура("Смета,Итог",ТекДанные.Элемент,ПредопределенноеЗначение("Справочник.СМ_ИтогиСметыПоВидамРабот.МонтажнРаб"));
			СМ_СметаВызовСервера.ДополнитьРеквизитыРегистраСведенийНабор("СМ_ИтогиПоВидамРабот", Отбор, ДанныеДляЗаписи);
			
			
			ДанныеДляЗаписи = Новый Структура(ИмяРесурса,ТекДанные.Прочие,ТекДанные.Элемент,ПредопределенноеЗначение("Справочник.СМ_ИтогиСметыПоВидамРабот.ПрочРаб"));
			Отбор = Новый Структура("Смета,Итог",ТекДанные.Элемент,ПредопределенноеЗначение("Справочник.СМ_ИтогиСметыПоВидамРабот.ПрочРаб"));
			СМ_СметаВызовСервера.ДополнитьРеквизитыРегистраСведенийНабор("СМ_ИтогиПоВидамРабот", Отбор, ДанныеДляЗаписи);
			
			
			Если Объект.БазисныеЦены Тогда
				ИмяРесурса = "Оборуд,Смета,Итог";
			Иначе
				ИмяРесурса = "ТекОборуд,Смета,Итог";
			КонецЕсли;
			
			ДанныеДляЗаписи = Новый Структура(ИмяРесурса,ТекДанные.Оборудование,ТекДанные.Элемент,ПредопределенноеЗначение("Справочник.СМ_ИтогиСметыПоВидамРабот.Оборуд"));
			Отбор = Новый Структура("Смета,Итог",ТекДанные.Элемент,ПредопределенноеЗначение("Справочник.СМ_ИтогиСметыПоВидамРабот.Оборуд"));
			СМ_СметаВызовСервера.ДополнитьРеквизитыРегистраСведенийНабор("СМ_ИтогиПоВидамРабот", Отбор, ДанныеДляЗаписи);

		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СметаРассчитана(СметаЭл)
	Если ТипЗнч(СметаЭл) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета")
		И СметаЭл.СметаРассчитана Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ТекДанные = Параметры.ТекДанные;
		НоваяЛС = СМ_СметаВызовСервера.СоздатьНовуюЛокальнуюСметуРассчитанную(ТекДанные.Наименование,Объект.Ссылка,ТекДанные.НомерСметы);
		ТекДанные.НоваяЛС = Ложь;
		НоваяСтрока 					= Объект.Сметы.Добавить();
		НоваяСтрока.Смета 		= НоваяЛС;
		НоваяСтрока.КоличествоОбъектов 	= ТекДанные.КоличествоОбъектов;
		НоваяСтрока.НомерПП				= ТекДанные.НомерПП;
		НоваяСтрока.ГлаваССРС			= ТекДанные.Глава;
		НоваяСтрока.Расчет				= Истина;

		Если Объект.БазисныеЦены Тогда
			ИмяРесурса = "ПрямЗатраты,ОснЗарплата,Смета,Итог";
		Иначе
			ИмяРесурса = "ТекПрямЗатраты,ТекОснЗарплата,Смета,Итог";
		КонецЕсли;
		
		ДанныеДляЗаписи = Новый Структура(ИмяРесурса,ТекДанные.СтроительныеРаботы,ТекДанные.ОплатаТруда,НоваяЛС,ПредопределенноеЗначение("Справочник.СМ_ИтогиСметыПоВидамРабот.СтроитРаб"));
		Отбор = Новый Структура("Смета,Итог",НоваяЛС,ПредопределенноеЗначение("Справочник.СМ_ИтогиСметыПоВидамРабот.СтроитРаб"));
		СМ_СметаВызовСервера.ЗаписатьРеквизитыРегистраСведенийНабор("СМ_ИтогиПоВидамРабот", Отбор, ДанныеДляЗаписи);
		
		Если Объект.БазисныеЦены Тогда
			ИмяРесурса = "ПрямЗатраты,Смета,Итог";
		Иначе
			ИмяРесурса = "ТекПрямЗатраты,Смета,Итог";
		КонецЕсли;

		ДанныеДляЗаписи = Новый Структура(ИмяРесурса,ТекДанные.МонтажныеРаботы,НоваяЛС,ПредопределенноеЗначение("Справочник.СМ_ИтогиСметыПоВидамРабот.МонтажнРаб"));
		Отбор = Новый Структура("Смета,Итог",НоваяЛС,ПредопределенноеЗначение("Справочник.СМ_ИтогиСметыПоВидамРабот.МонтажнРаб"));
		СМ_СметаВызовСервера.ЗаписатьРеквизитыРегистраСведенийНабор("СМ_ИтогиПоВидамРабот", Отбор, ДанныеДляЗаписи);
		
		
		ДанныеДляЗаписи = Новый Структура(ИмяРесурса,ТекДанные.Прочие,НоваяЛС,ПредопределенноеЗначение("Справочник.СМ_ИтогиСметыПоВидамРабот.ПрочРаб"));
		Отбор = Новый Структура("Смета,Итог",НоваяЛС,ПредопределенноеЗначение("Справочник.СМ_ИтогиСметыПоВидамРабот.ПрочРаб"));
		СМ_СметаВызовСервера.ЗаписатьРеквизитыРегистраСведенийНабор("СМ_ИтогиПоВидамРабот", Отбор, ДанныеДляЗаписи);
		
		Если Объект.БазисныеЦены Тогда
			ИмяРесурса = "Оборуд,Смета,Итог";
		Иначе
			ИмяРесурса = "ТекОборуд,Смета,Итог";
		КонецЕсли;
		
		ДанныеДляЗаписи = Новый Структура(ИмяРесурса,ТекДанные.Оборудование,НоваяЛС,ПредопределенноеЗначение("Справочник.СМ_ИтогиСметыПоВидамРабот.Оборуд"));
		Отбор = Новый Структура("Смета,Итог",НоваяЛС,ПредопределенноеЗначение("Справочник.СМ_ИтогиСметыПоВидамРабот.Оборуд"));
		СМ_СметаВызовСервера.ЗаписатьРеквизитыРегистраСведенийНабор("СМ_ИтогиПоВидамРабот", Отбор, ДанныеДляЗаписи);

		// Записать();
		ОбновитьДеревоСС();;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновитьДеревоССОС" Тогда
		Если Параметр.Свойство("СписокСмет") Тогда
			ИндексСтроки = Параметр.СписокСмет.Найти(Объект.Ссылка);
			Если Не ИндексСтроки = Неопределено Тогда
				ОбновитьДеревоСС();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПредупреждениеНаФорме(Текст)
	
	Элементы.ТекстПредупреждения.Видимость 		= Истина;
	Элементы.ТекстПредупреждения.Доступность 	= Истина;
	ТекстПредупреждения = Текст;
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПредупреждениеНаФорме()
	
	Элементы.ТекстПредупреждения.Видимость 		= Ложь;
	Элементы.ТекстПредупреждения.Доступность 	= Ложь;
	ТекстПредупреждения = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьДоступностьЭлементовНаФорме()
	
	СкрытьПредупреждениеНаФорме();
	Если (Объект.Статус = ПредопределенноеЗначение("Перечисление.СМ_СтатусыСметныхДокументов.Согласован")) или ТолькоПросмотрФормы Тогда
		Если Не ТолькоПросмотрФормы Тогда
			ПоказатьПредупреждениеНаФорме(НСтр("ru='Смета согласована, для изменения смените статус!'"));
		КонецЕсли;
		Для каждого Элем Из ЭтаФорма.Элементы Цикл
			Если ТипЗнч(Элем) = Тип("ДекорацияФормы") ИЛИ ТипЗнч(Элем) = Тип("ДополнениеЭлементаФормы") ИЛИ Элем = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если Найти(ВРЕГ(Элем.Имя),"ПЕЧАТ")>0 ИЛИ Элем.Имя = "ФормаЗакрыть" 
				ИЛИ Элем.Имя = "УбратьМобильное" ИЛИ Элем.Имя = "Мобильное"
				ИЛИ Элем.Имя = "ФормаПрисоединенныеФайлы" ИЛИ Элем.Имя = "ФормаЗаписать" Тогда
				Продолжить;
			КонецЕсли;
			Если ТипЗнч(Элем) = Тип("КнопкаФормы") Тогда
				Элем.Доступность = Ложь;
			Иначе
				Элем.ТолькоПросмотр = Истина;
			КонецЕсли;
		КонецЦикла;
	Иначе
		ЭтаФорма.ТолькоПросмотр = Ложь;
		Для каждого Элем Из ЭтаФорма.Элементы Цикл
			Если ТипЗнч(Элем) = Тип("ДекорацияФормы") ИЛИ ТипЗнч(Элем) = Тип("ДополнениеЭлементаФормы") ИЛИ Элем = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если Найти(ВРЕГ(Элем.Имя),"ПЕЧАТ")>0 ИЛИ Элем.Имя = "ФормаЗакрыть" 
				ИЛИ Элем.Имя = "УбратьМобильное" ИЛИ Элем.Имя = "Мобильное"
				ИЛИ Элем.Имя = "ФормаПрисоединенныеФайлы" ИЛИ Элем.Имя = "ФормаЗаписать" Тогда
				Продолжить;
			КонецЕсли;
			Если ТипЗнч(Элем) = Тип("КнопкаФормы") Тогда
				Элем.Доступность = Истина;
			Иначе
				Элем.ТолькоПросмотр = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Админ Тогда
		Элементы.Статус.ТолькоПросмотр = Ложь;
		Элементы.ГруппаГлавная.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СМ_СтатусыСметныхДокументов.Согласован") И Не Объект.Проведен Тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	КонецЕсли;
	ВидимостьДоступностьЭлементовНаФорме();
КонецПроцедуры

&НаСервере
Процедура ПерерасчетНаСервере()
	Документы.СМ_СводнаяСмета.ПерерасчетПодчиненныхСмет(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура Перерасчет(Команда)
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	ПерерасчетНаСервере();
КонецПроцедуры

&НаСервере
Процедура НаименованиеОбработкаВыбораНаСервере(ВыбранноеЗначение, СтандартнаяОбработка)
	
	Смета = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.СМ_СводнаяСмета"));
	СМ_СметаВызовСервера.ЗаполнитьНомерПоСпискуВыбораШаблона(Смета, ВыбранноеЗначение, СтандартнаяОбработка, "НумераторСводныхСмет");
	ЗначениеВДанныеФормы(Смета, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	НаименованиеОбработкаВыбораНаСервере(ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СтройкаПриИзменении(Элемент)
	
	СМ_СметаВызовСервера.ИзменитьСтройку(Объект.Ссылка,  Объект.Стройка);
	
КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
